ugly3/note/GD32F407VET6/Project/GD32F407VET6_ALL/User/sys.h
#ifndef __SYS_H
#define __SYS_H	 
#include "gd32f4xx.h"                   // Device header


//0,不支持os
//1,支持os
#define SYSTEM_SUPPORT_OS		1		//定义系统文件夹是否支持OS
#define	u32 uint32_t										    

//位带操作,实现51类似的GPIO控制功能
//具体实现思想,参考<<CM3权威指南>>第五章(87页~92页).M4同M3类似,只是寄存器地址变了.
//IO口操作宏定义
#define BITBAND(addr, bitnum) ((addr & 0xF0000000)+0x2000000+((addr &0xFFFFF)<<5)+(bitnum<<2)) 
#define MEM_ADDR(addr)  *((volatile unsigned long  *)(addr)) 
#define BIT_ADDR(addr, bitnum)   MEM_ADDR(BITBAND(addr, bitnum)) 
//IO口地址映射
#define GPIOA_ODR_Addr    (GPIO_BASE+20) //0x40020014
#define GPIOB_ODR_Addr    (GPIO_BASE+20) //0x40020414 
#define GPIOC_ODR_Addr    (GPIO_BASE+20) //0x40020814 
#define GPIOD_ODR_Addr    (GPIO_BASE+20) //0x40020C14 
#define GPIOE_ODR_Addr    (GPIO_BASE+20) //0x40021014 
#define GPIOF_ODR_Addr    (GPIO_BASE+20) //0x40021414    
#define GPIOG_ODR_Addr    (GPIO_BASE+20) //0x40021814   
#define GPIOH_ODR_Addr    (GPIO_BASE+20) //0x40021C14    
#define GPIOI_ODR_Addr    (GPIO_BASE+20) //0x40022014     

#define GPIOA_IDR_Addr    (GPIO_BASE+16) //0x40020010 
#define GPIOB_IDR_Addr    (GPIO_BASE+16) //0x40020410 
#define GPIOC_IDR_Addr    (GPIO_BASE+16) //0x40020810 
#define GPIOD_IDR_Addr    (GPIO_BASE+16) //0x40020C10 
#define GPIOE_IDR_Addr    (GPIO_BASE+16) //0x40021010 
#define GPIOF_IDR_Addr    (GPIO_BASE+16) //0x40021410 
#define GPIOG_IDR_Addr    (GPIO_BASE+16) //0x40021810 
#define GPIOH_IDR_Addr    (GPIO_BASE+16) //0x40021C10 
#define GPIOI_IDR_Addr    (GPIO_BASE+16) //0x40022010 
 
//IO口操作,只对单一的IO口!
//确保n的值小于16!
#define PAout(n)   BIT_ADDR(GPIOA_ODR_Addr,n)  //输出 
#define PAin(n)    BIT_ADDR(GPIOA_IDR_Addr,n)  //输入 

#define PBout(n)   BIT_ADDR(GPIOB_ODR_Addr,n)  //输出 
#define PBin(n)    BIT_ADDR(GPIOB_IDR_Addr,n)  //输入 

#define PCout(n)   BIT_ADDR(GPIOC_ODR_Addr,n)  //输出 
#define PCin(n)    BIT_ADDR(GPIOC_IDR_Addr,n)  //输入 

#define PDout(n)   BIT_ADDR(GPIOD_ODR_Addr,n)  //输出 
#define PDin(n)    BIT_ADDR(GPIOD_IDR_Addr,n)  //输入 

#define PEout(n)   BIT_ADDR(GPIOE_ODR_Addr,n)  //输出 
#define PEin(n)    BIT_ADDR(GPIOE_IDR_Addr,n)  //输入

#define PFout(n)   BIT_ADDR(GPIOF_ODR_Addr,n)  //输出 
#define PFin(n)    BIT_ADDR(GPIOF_IDR_Addr,n)  //输入

#define PGout(n)   BIT_ADDR(GPIOG_ODR_Addr,n)  //输出 
#define PGin(n)    BIT_ADDR(GPIOG_IDR_Addr,n)  //输入

#define PHout(n)   BIT_ADDR(GPIOH_ODR_Addr,n)  //输出 
#define PHin(n)    BIT_ADDR(GPIOH_IDR_Addr,n)  //输入

#define PIout(n)   BIT_ADDR(GPIOI_ODR_Addr,n)  //输出 
#define PIin(n)    BIT_ADDR(GPIOI_IDR_Addr,n)  //输入

//以下为汇编函数
void WFI_SET(void);		//执行WFI指令
void INTX_DISABLE(void);//关闭所有中断
void INTX_ENABLE(void);	//开启所有中断
void MSR_MSP(u32 addr);	//设置堆栈地址 
#endif
